snlkuharlocal/src/Catalogs/ТНВЭД/ТНВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТНВЭД</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АнглоязычноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботыСМаркировкой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбязательнойРаботыСМаркировкой</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСимволовВКарточку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРазмера</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативУтилизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЭкологическогоСбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КлассификаторыДляМаркировки</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользовать</name>
      <comment>Не использовать</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ТНВЭД/ManagerModule.bsl
// Чирков 14.02.2024 +++
Функция ПолучитьПараметрыНоменклатурыНК(ТНВЭД) Экспорт
	Результат = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка();
	
	Запрос	= Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка КАК ТНВЭД	
	|ИЗ
	|	Справочник.ТНВЭД
	|ГДЕ
	|	Ссылка = &ТНВЭД
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ		
	|";	
	
	Запрос.УстановитьПараметр("ТНВЭД", 		ТНВЭД);	
	
	тГруппы = Запрос.Выполнить().Выгрузить();
	тГруппы.Колонки.Добавить("Уровень", ПолучитьОписаниеТиповЧисла(3));
	Для Каждого СтрокаТ Из тГруппы Цикл
		СтрокаТ.Уровень = тГруппы.Индекс(СтрокаТ)+1;	
	КонецЦикла; 
	
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Группы ИЗ &тГруппы КАК тГруппы
	|;
	|ВЫБРАТЬ
	|	ВТ_Группы.Уровень 	КАК Уровень,	
	|	Ссылка				КАК ТНВЭД,	
	|	Параметр			КАК Параметр,
	|	НеИспользовать		КАК НеИспользовать,
	|	Обязательное		КАК Обязательное	
	|ПОМЕСТИТЬ ВТ_Параметры
	|ИЗ
	|	Справочник.ТНВЭД.КлассификаторыДляМаркировки КАК ТЧ_Параметры
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	ВТ_Группы
	|ПО
	|	ТЧ_Параметры.Ссылка = ВТ_Группы.ТНВЭД	
	|;	
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_Параметры.Уровень) 	КАК Уровень,
	|	Параметр
	|ПОМЕСТИТЬ ВТ_МаксУровни
	|ИЗ
	|	ВТ_Параметры
	|СГРУППИРОВАТЬ ПО
	|	Параметр
	|;
	|ВЫБРАТЬ
	|	ВТ_МаксУровни.Уровень	 	КАК Уровень,
	|	ВТ_МаксУровни.Параметр		КАК Свойство,	
	|	ВТ_Параметры.Обязательное 	КАК Обязательное
	|ИЗ
	|	ВТ_МаксУровни
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Параметры
	|ПО
	|	ВТ_МаксУровни.Уровень 		= ВТ_Параметры.Уровень 
	|	И ВТ_МаксУровни.Параметр 	= ВТ_Параметры.Параметр 
	|ГДЕ
	|	ВТ_Параметры.НеИспользовать = Ложь
	|УПОРЯДОЧИТЬ ПО	
	|	ВТ_МаксУровни.Параметр.Наименование
	|";
	
	Запрос.УстановитьПараметр("тГруппы", тГруппы);	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;	
КонецФункции // ()
// Чирков 14.02.2024 +++
